# With `brew bundle`, `brew` installs OR upgrades formulae listed here

# Things that frequently required by development environments/runtimes
brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libtool"
brew "unixodbc"
brew "git"
brew "wget"

# Other utilities. Make sure gpg 2+ is installed in order to use gpg-agent with keychain
brew "jq"
brew "gpg2"
brew "pinentry-mac"
brew "fzf"
brew "gnu-sed"
brew "expect"
brew "shellcheck"
brew "direnv"
brew "mise"
brew "gh"
brew "starship"
